/*****************************************************************************

//		                 HC32F46x的misc实现

****************************************************************************/
#ifndef __MISC_H
#define __MISC_H
#include "HC32.h"

//-------------------------------系统时钟配置-----------------------------------
void SystemClockConfig(void);

//-----------------------------------中断配置----------------------------------
//使用此函数后，需实现startup中的“IRQnnn_Handler”函数
void NVIC_Config(unsigned int Priority, //主优先级，3-15, 越小优先级越高！
                 IRQn_Type IRQn,         //硬件定义的中断号,0~31无限制，以上注意对应关系
                 enum en_int_src IntSrc);   //硬件中的中断源

#endif

